In [1]:
## enumerate함수 :열거하다
## 많은 양의 데이터인 list를 다룰 때 편리하게 쓸 수 있는 기능을 제공
## for-each, for
# for x in list: 리스트에 있는 것을 하나씩 꺼내서 처리하기가 아주 간단
#                    index가 없어서 불편!
#                    하나씩 꺼내서 출력, 연산하기는 용이
#                    리스트에 입력은 안된다.!
# for i in range(n): 리스트의 입력과 출력이 다 됨.
#                    인덱스로 리스트에 있는 값들을 접근해야하기 때문에
#                    코드가 복잡하게 보인다.

In [2]:
num_list = [100, 200, 300]

In [3]:
for x in num_list:
    print(x + 100)

200
300
400

In [5]:
for x in enumerate(num_list):
    print(x)

(0, 100)
(1, 200)
(2, 300)

In [7]:
for i, x in enumerate(num_list):
    print(i, ':', x)

0 : 100
1 : 200
2 : 300

In [8]:
for i, x in enumerate(num_list):
    num_list[i] = x + 100

In [9]:
num_list

[200, 300, 400]

In [10]:
from sklearn.model_selection import KFold

In [11]:
kfold = KFold(n_splits=5)

In [15]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [20]:
titanic_df = pd.read_csv('./titanic_train.csv')
titanic_df.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,body,home.dest
0,2,1,"Mellinger, Miss. Madeleine Violet",female,13.0,0,1,250644,19.5,NaN,S,NaN,"England / Bennington, VT"
1,2,1,"Wells, Miss. Joan",female,4.0,1,1,29103,23.0,NaN,S,NaN,"Cornwall / Akron, OH"

In [21]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 898 entries, 0 to 897
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     898 non-null    int64
 1   survived   898 non-null    int64
 2   name       898 non-null    object
 3   sex        898 non-null    object
 4   age        728 non-null    float64
 5   sibsp      898 non-null    int64
 6   parch      898 non-null    int64
 7   ticket     898 non-null    object
 8   fare       898 non-null    float64
 9   cabin      211 non-null    object
 10  embarked   896 non-null    object
 11  body       84 non-null     float64
 12  home.dest  516 non-null    object
dtypes: float64(3), int64(4), object(6)
memory usage: 91.3+ KB

In [ ]:
## 함수(drop처리)
## name, ticket, body, home.dest

In [ ]:
## 함수(na처리)
## age는 평균으로 채워주세요.
## cabin은 N으로 채워주세요.
## embarked는 N으로 채워주세요.(fillna())
## na개수가 몇개인지 전체 카운트